src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Memtier/RedisResults_1.txt
6379
4         Threads
1         Connections per thread
30        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        35598.74          ---          ---         0.34304         0.33500         0.47900         0.55900         0.83900         1.54300      2742.53
Gets       320388.28    320388.28         0.00         0.34300         0.33500         0.47900         0.55900         0.83900         1.54300     23118.30
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals     355987.03    320388.28         0.00         0.34301         0.33500         0.47900         0.55900         0.83900         1.54300     25860.83


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.119        0.000
SET       0.207        5.000
SET       0.215       10.000
SET       0.231       15.000
SET       0.239       20.000
SET       0.255       25.000
SET       0.263       30.000
SET       0.271       35.000
SET       0.287       40.000
SET       0.295       45.000
SET       0.335       50.000
SET       0.343       52.500
SET       0.351       55.000
SET       0.351       57.500
SET       0.359       60.000
SET       0.359       62.500
SET       0.367       65.000
SET       0.367       67.500
SET       0.375       70.000
SET       0.375       72.500
SET       0.383       75.000
SET       0.399       76.250
SET       0.423       77.500
SET       0.439       78.750
SET       0.447       80.000
SET       0.447       81.250
SET       0.455       82.500
SET       0.455       83.750
SET       0.463       85.000
SET       0.463       86.250
SET       0.463       87.500
SET       0.471       88.125
SET       0.471       88.750
SET       0.471       89.375
SET       0.479       90.000
SET       0.487       90.625
SET       0.511       91.250
SET       0.527       91.875
SET       0.535       92.500
SET       0.543       93.125
SET       0.543       93.750
SET       0.551       94.062
SET       0.551       94.375
SET       0.551       94.688
SET       0.559       95.000
SET       0.559       95.312
SET       0.567       95.625
SET       0.583       95.938
SET       0.599       96.250
SET       0.607       96.562
SET       0.615       96.875
SET       0.615       97.031
SET       0.623       97.188
SET       0.623       97.344
SET       0.631       97.500
SET       0.639       97.656
SET       0.655       97.812
SET       0.671       97.969
SET       0.695       98.125
SET       0.719       98.281
SET       0.743       98.438
SET       0.751       98.516
SET       0.759       98.594
SET       0.767       98.672
SET       0.783       98.750
SET       0.799       98.828
SET       0.823       98.906
SET       0.839       98.984
SET       0.855       99.062
SET       0.863       99.141
SET       0.887       99.219
SET       0.895       99.258
SET       0.911       99.297
SET       0.919       99.336
SET       0.927       99.375
SET       0.935       99.414
SET       0.943       99.453
SET       0.951       99.492
SET       0.959       99.531
SET       0.975       99.570
SET       0.991       99.609
SET       0.999       99.629
SET       1.007       99.648
SET       1.015       99.668
SET       1.023       99.688
SET       1.039       99.707
SET       1.047       99.727
SET       1.055       99.746
SET       1.071       99.766
SET       1.087       99.785
SET       1.111       99.805
SET       1.119       99.814
SET       1.127       99.824
SET       1.143       99.834
SET       1.167       99.844
SET       1.199       99.854
SET       1.223       99.863
SET       1.271       99.873
SET       1.335       99.883
SET       1.415       99.893
SET       1.575       99.902
SET       1.671       99.907
SET       1.743       99.912
SET       1.815       99.917
SET       1.887       99.922
SET       1.935       99.927
SET       2.031       99.932
SET       2.095       99.937
SET       2.207       99.941
SET       2.303       99.946
SET       2.399       99.951
SET       2.431       99.954
SET       2.463       99.956
SET       2.511       99.958
SET       2.543       99.961
SET       2.575       99.963
SET       2.655       99.966
SET       2.831       99.968
SET       2.911       99.971
SET       3.103       99.973
SET       3.215       99.976
SET       3.455       99.977
SET       3.727       99.978
SET       3.903       99.979
SET       4.031       99.980
SET       4.191       99.982
SET       4.255       99.983
SET       4.287       99.984
SET       4.319       99.985
SET       4.351       99.987
SET       4.383       99.988
SET       4.479       99.988
SET       4.767       99.989
SET       4.863       99.990
SET       5.087       99.990
SET       5.151       99.991
SET       5.247       99.991
SET       5.343       99.992
SET       5.503       99.993
SET       5.567       99.993
SET       5.599       99.994
SET       5.759       99.994
SET       5.791       99.995
SET       6.079       99.995
SET       6.111       99.995
SET       6.143       99.995
SET       6.335       99.996
SET       6.463       99.996
SET       6.463       99.996
SET       6.527       99.997
SET       7.231       99.997
SET       7.231       99.997
SET       7.263       99.997
SET       7.263       99.997
SET       7.263       99.998
SET       7.743       99.998
SET       7.775       99.998
SET       7.775       99.998
SET       7.935       99.998
SET       7.935       99.998
SET       7.935       99.998
SET       8.255       99.999
SET       8.255       99.999
SET       8.255       99.999
[...]
SET       8.319       99.999
SET       8.319       99.999
SET       8.319       99.999
[...]
SET      10.943       99.999
SET      10.943       99.999
SET      10.943       99.999
[...]
SET      10.943      100.000
SET      10.943      100.000
SET      10.943      100.000
[...]
SET      11.327      100.000
SET      11.327      100.000
---
GET       0.119        0.000
GET       0.207        5.000
GET       0.215       10.000
GET       0.231       15.000
GET       0.239       20.000
GET       0.255       25.000
GET       0.263       30.000
GET       0.271       35.000
GET       0.287       40.000
GET       0.295       45.000
GET       0.335       50.000
GET       0.343       52.500
GET       0.351       55.000
GET       0.351       57.500
GET       0.359       60.000
GET       0.359       62.500
GET       0.367       65.000
GET       0.367       67.500
GET       0.375       70.000
GET       0.375       72.500
GET       0.383       75.000
GET       0.399       76.250
GET       0.423       77.500
GET       0.439       78.750
GET       0.447       80.000
GET       0.447       81.250
GET       0.455       82.500
GET       0.455       83.750
GET       0.463       85.000
GET       0.463       86.250
GET       0.463       87.500
GET       0.471       88.125
GET       0.471       88.750
GET       0.471       89.375
GET       0.479       90.000
GET       0.487       90.625
GET       0.511       91.250
GET       0.527       91.875
GET       0.535       92.500
GET       0.543       93.125
GET       0.543       93.750
GET       0.551       94.062
GET       0.551       94.375
GET       0.551       94.688
GET       0.559       95.000
GET       0.559       95.312
GET       0.567       95.625
GET       0.583       95.938
GET       0.599       96.250
GET       0.607       96.562
GET       0.615       96.875
GET       0.615       97.031
GET       0.623       97.188
GET       0.623       97.344
GET       0.631       97.500
GET       0.647       97.656
GET       0.655       97.812
GET       0.671       97.969
GET       0.695       98.125
GET       0.719       98.281
GET       0.743       98.438
GET       0.751       98.516
GET       0.759       98.594
GET       0.767       98.672
GET       0.783       98.750
GET       0.799       98.828
GET       0.823       98.906
GET       0.839       98.984
GET       0.855       99.062
GET       0.863       99.141
GET       0.887       99.219
GET       0.895       99.258
GET       0.911       99.297
GET       0.919       99.336
GET       0.927       99.375
GET       0.935       99.414
GET       0.943       99.453
GET       0.951       99.492
GET       0.959       99.531
GET       0.975       99.570
GET       0.991       99.609
GET       0.999       99.629
GET       1.007       99.648
GET       1.015       99.668
GET       1.023       99.688
GET       1.039       99.707
GET       1.047       99.727
GET       1.055       99.746
GET       1.071       99.766
GET       1.087       99.785
GET       1.111       99.805
GET       1.119       99.814
GET       1.127       99.824
GET       1.143       99.834
GET       1.167       99.844
GET       1.199       99.854
GET       1.223       99.863
GET       1.271       99.873
GET       1.335       99.883
GET       1.415       99.893
GET       1.575       99.902
GET       1.679       99.907
GET       1.743       99.912
GET       1.831       99.917
GET       1.895       99.922
GET       1.935       99.927
GET       2.039       99.932
GET       2.127       99.937
GET       2.207       99.941
GET       2.303       99.946
GET       2.399       99.951
GET       2.447       99.954
GET       2.479       99.956
GET       2.527       99.958
GET       2.543       99.961
GET       2.607       99.963
GET       2.687       99.966
GET       2.847       99.968
GET       2.943       99.971
GET       3.135       99.973
GET       3.295       99.976
GET       3.503       99.977
GET       3.823       99.978
GET       3.919       99.979
GET       4.031       99.980
GET       4.223       99.982
GET       4.287       99.983
GET       4.319       99.984
GET       4.319       99.985
GET       4.351       99.987
GET       4.383       99.988
GET       4.479       99.988
GET       4.767       99.989
GET       4.863       99.990
GET       5.087       99.990
GET       5.151       99.991
GET       5.247       99.991
GET       5.343       99.992
GET       5.503       99.993
GET       5.567       99.993
GET       5.599       99.994
GET       5.759       99.994
GET       5.791       99.995
GET       6.079       99.995
GET       6.111       99.995
GET       6.143       99.995
GET       6.335       99.996
GET       6.463       99.996
GET       6.463       99.996
GET       6.495       99.997
GET       6.527       99.997
GET       7.231       99.997
GET       7.231       99.997
GET       7.263       99.997
GET       7.263       99.998
GET       7.743       99.998
GET       7.743       99.998
GET       7.775       99.998
GET       7.775       99.998
GET       7.935       99.998
GET       7.935       99.998
GET       8.255       99.999
GET       8.255       99.999
GET       8.255       99.999
[...]
GET       8.319       99.999
GET       8.319       99.999
GET       8.319       99.999
[...]
GET      10.943       99.999
GET      10.943       99.999
GET      10.943      100.000
GET      10.943      100.000
GET      10.943      100.000
[...]
GET      11.327      100.000
GET      11.327      100.000
---
WAIT      0.000      100.000